// 약관 제목과 내용을 이곳에서 한번에 관리합니다.

export const policyContents = {
  // 전화 상담 폼에 사용될 내용
  phone: {
    privacy: {
      title: '개인정보 수집 및 이용 동의 (전화 상담)',
      content: `프라임에셋 333본부 신지후는 「개인정보 보호법」에 따라 귀하의 개인정보를 다음과 같이 수집·이용하고자 합니다.

- 개인정보의 수집∙이용 목적 : 보험상담 및 상품 소개, 보험리모델링 서비스 제공, 가입권유
- 수집·이용하는 개인정보의 내용 : 성명, 성별, 생년월일, 전화번호
- 개인정보 보유·이용 기간 : 수집일로부터 12개월(단, 이용 목적 달성 시 즉시 파기)
- 보험상담 및 가입권유 연락방법 : 전화, 문자메세지

※ 본 동의를 거부하실수 있으나, 거부하는 경우에는 보험상품 소개 및 가입상담 서비스 제공이 제한될 수 있습니다.
※ 동의하시더라도 고객센터(010-4554-5587)를 통해 동의를 철회하거나 가입권유 목적의 연락에 대한 중단을 요청하실 수 있습니다.`,
    },
    thirdParty: {
      title: '제3자 정보 제공 동의 (전화 상담)',
      content: `프라임에셋 333본부 신지후는 「개인정보 보호법」에 따라 귀하의 개인정보를 다음과 같이 제3자에게 제공하고자 합니다.

- 개인정보를 제공받는 자 : 프라임에셋 333본부 소속 설계사
- 개인정보의 수집∙이용 목적 : 보험상담 및 가입권유 서비스
- 수집·이용하는 개인정보의 내용 : 성명, 성별, 생년월일, 전화번호
- 제공받는 자의 개인정보 보유·이용 기간 : 제공일(수집일)로부터 12개월(단, 이용 목적 달성 시 즉시 파기)
- 보험상담 및 가입권유 연락방법 : 전화, 문자메세지

※ 본 동의를 거부하실수 있으나, 거부하는 경우에는 보험상품 소개 및 가입상담 서비스 제공이 제한될 수 있습니다.
※ 동의하시더라도 고객센터(010-4554-5587) 를 통해 동의를 철회하거나 가입권유 목적의 연락에 대한 중단을 요청하실 수 있습니다.`,
    },
  },
  // 온라인 분석 폼에 사용될 내용
  online: {
    privacy: {
      title: '개인정보 수집 및 이용 동의 (온라인 분석)',
      content: `프라임에셋 333본부 신지후는 「개인정보 보호법」에 따라 귀하의 개인정보를 다음과 같이 수집·이용하고자 합니다.

- 개인정보의 수집∙이용 목적 : 보험상담 및 상품 소개, 보험리모델링 서비스 제공, 가입권유
- 수집·이용하는 개인정보의 내용 : 성명, 성별, 주민등록번호, 전화번호
- 개인정보 보유·이용 기간 : 수집일로부터 12개월(단, 이용 목적 달성 시 즉시 파기)
- 보험상담 및 가입권유 연락방법 : 전화, 문자메세지

※ 본 동의를 거부하실수 있으나, 거부하는 경우에는 보험상품 소개 및 가입상담 서비스 제공이 제한될 수 있습니다.
※ 동의하시더라도 고객센터(010-4554-5587)를 통해 동의를 철회하거나 가입권유 목적의 연락에 대한 중단을 요청하실 수 있습니다.`,
    },
    thirdParty: {
      title: '제3자 정보 제공 동의 (온라인 분석)',
      content: `프라임에셋 333본부 신지후는 「개인정보 보호법」에 따라 귀하의 개인정보를 다음과 같이 제3자에게 제공하고자 합니다.

- 개인정보를 제공받는 자 : 프라임에셋 333본부 소속 설계사
- 개인정보의 수집∙이용 목적 : 보험상담 및 가입권유 서비스
- 수집·이용하는 개인정보의 내용 : 성명, 성별, 주민등록번호, 전화번호
- 제공받는 자의 개인정보 보유·이용 기간 : 제공일(수집일)로부터 12개월(단, 이용 목적 달성 시 즉시 파기)
- 보험상담 및 가입권유 연락방법 : 전화, 문자메세지

※ 본 동의를 거부하실수 있으나, 거부하는 경우에는 보험상품 소개 및 가입상담 서비스 제공이 제한될 수 있습니다.
※ 동의하시더라도 고객센터(010-4554-5587) 를 통해 동의를 철회하거나 가입권유 목적의 연락에 대한 중단을 요청하실 수 있습니다.`,
    },
  },
};

// 타입을 정의해두면 자동완성 기능으로 편리하게 사용할 수 있습니다.
export type FormType = keyof typeof policyContents;
export type ContentType = keyof typeof policyContents.phone;

